### ***COVARIANCE AND CORELATION***

### ***COVARINCE***

### ***Relationship between X and Y***

X     Y  
2     3  
4     5  
6     7  
8     9  

---

#### ***Direction based Relationship***

POSITIVE RELATIONSHIP  

X ↑     Y ↑  
X ↓     Y ↓  

NEGATIVE RELATIONSHIP  

X ↑     Y ↓  
X ↓     Y ↑  

---

#### ***Scatter Plot Interpretation***

POSITIVE CORRELATION  
• As X increases, Y also increases  
• Points move upward  

NEGATIVE CORRELATION  
• As X increases, Y decreases  
• Points move downward  

---

#### ***Covariance***

Cov(X , Y) =  
Σ ( xi − x̄ )( yi − ȳ )  / 
        n − 1  

Where,  
xi  → datapoint of X  
x̄   → sample mean of X  
yi  → datapoint of Y  
ȳ   → sample mean of Y  

---

#### ***Variance***

Var(X) =  
Σ ( xi − x̄ )²  /  
   n − 1  

Var(X) = Cov(X , X)  

→ Variance shows SPREAD of data  

---

#### ***Covariance Sign***

POSITIVE COVARIANCE  

X ↑     Y ↑  
X ↓     Y ↓  

NEGATIVE COVARIANCE  

X ↑     Y ↓  
X ↓     Y ↑  

---

#### ***Example***

X     Y  
2     3  
4     5  
6     7  

x̄ = 4  
ȳ = 5  

Cov(X , Y) =  
(2−4)(3−5) + (4−4)(5−5) + (6−4)(7−5)  /  
                 2  

= (4 + 0 + 4) / 2  
= 8 / 2  
= 4  

→ Positive Covariance  

---

####  ***Advantages***

1. Shows relationship between X and Y  
2. Shows +ve or −ve direction  

---

#### ***Disadvantages***

1. No fixed limit value  
2. Hard to interpret  

---

#### ***Pearson Correlation Coefficient***

Range :  −1  to  +1  

r(x , y) =  
Cov(X , Y)  /
 σx   σy  

---

#### ***Interpretation***

r → +1  : Strong Positive Correlation  
r → −1  : Strong Negative Correlation  
r = 0   : No Linear Relationship

### (3) Spearman Rank Correlation   [ -1 to 1 ]

rs  =  Cov ( R(x) , R(y) )/
       σ ( R(x) ) * σ ( R(y) )




| X | Y | R(x) | R(y) |
|---|---|------|------|
| 1 | 2 | 5 | 5 |
| 3 | 4 | 4 | 4 |
| 5 | 6 | 3 | 3 |
| 7 | 8 | 2 | 1 |
| 0 | 7 | 6 | 2 |
| 8 | 1 | 1 | 6 |

Feature Selection
-----------------

| Correlation Type | Feature |
|------------------|---------|
| +ve | Size of house ↑ |
| +ve | No. of rooms ↑ |
| +ve | Location ↑ |
| ≈ 0 | No. of people staying |
| -ve | Haunted |
| +ve | Price ↑ |

In [5]:
import seaborn as sns

In [9]:
df=sns.load_dataset('healthexp')
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [8]:
df_numeric = df.select_dtypes(include='number')
df_numeric.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [11]:
df_numeric = df.select_dtypes(include='number')
df_numeric.corr(method='pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [12]:
df_numeric = df.select_dtypes(include='number')
df_numeric.corr(method='spearman')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.931598         0.896117
Spending_USD     0.931598      1.000000         0.747407
Life_Expectancy  0.896117      0.747407         1.000000

In [13]:
df=sns.load_dataset('flights')
df.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [15]:
df_numeric = df.select_dtypes(include='number')
df_numeric.cov()

                  year    passengers
year         12.000000    383.087413
passengers  383.087413  14391.917201